university/app/views/students/show.html.erb

  <tbody>
    <% @student.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" INNER JOIN "student_enrollments" ON "sections"."id" = "student_enrollments"."section_id" WHERE "student_enrollments"."student_id" = ?  [["student_id", 1]]