university/app/views/professors/show.html.erb

    <tbody>
    <% @professor.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."professor_id" = ?  [["professor_id", 1]]

      <tr>
        <td>&nbsp;&nbsp;&nbsp;<%= section.students.count %> Students Enrolled</td>
---
SELECT "students".* FROM "students" INNER JOIN "student_enrollments" ON "students"."id" = "student_enrollments"."student_id" WHERE "student_enrollments"."section_id" = ?  [["section_id", 2]]
SELECT COUNT(*) FROM "students" INNER JOIN "student_enrollments" ON "students"."id" = "student_enrollments"."student_id" WHERE "student_enrollments"."section_id" = ?  [["section_id", 2]]