university/app/controllers/admin_users_controller.rb

  def create
    @admin_user = AdminUser.new(admin_user_params)
    if @admin_user.save
---
INSERT INTO "admin_users" ("first_name", "last_name", "email", "username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @admin_user = AdminUser.find(params[:id])
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @admin_user = AdminUser.find(params[:id])
    if @admin_user.update_attributes(admin_user_params)
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "admin_users" SET "password_digest" = ?, "updated_at" = ? WHERE "admin_users"."id" = ?  [["password_digest", "$2a$10$JosWMFiZ1A5yGxvgCqD1Xu6dcBJ51zl73gA3jPSegQFvoiE7J1N.G"], ["updated_at", "2017-10-02 02:49:15.334750"], ["id", 2]]