university/app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses" WHERE (name LIKE '%Underwater%' OR department LIKE '%Underwater%') ORDER BY created_at DESC

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "department", "hours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Underwater Basketweaving 1"], ["department", "Forensics"], ["hours", 2], ["created_at", "2017-10-01 19:08:07.220265"], ["updated_at", "2017-10-01 19:08:07.220265"]]