university/app/controllers/professors_controller.rb

SELECT "professors".* FROM "professors" WHERE (name LIKE ?,%Bill%) ORDER BY created_at DESC
---
  def index
    @professors = Professor.all

INSERT INTO "professors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Dr Billius Ravenschaeffer"], ["created_at", "2017-10-01 19:19:23.270049"], ["updated_at", "2017-10-01 19:19:23.270049"]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_professor
      @professor = Professor.find(params[:id])