university/app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE (section_professor_name LIKE '%Fishing%', OR section_course_name LIKE '%Fishing%') ORDER BY created_at DESC
---
  def index
    @sections = Section.all

INSERT INTO "sections" ("number", "course_id", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 1], ["course_id", 1], ["professor_id", 1], ["created_at", "2017-10-01 20:11:10.707575"], ["updated_at", "2017-10-01 20:11:10.707575"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 4]]
---
  def destroy
    @section.destroy

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])