university/app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "student_id", "credit_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Andrew"], ["last_name", "Roberts"], ["student_id", 123456789], ["credit_number", 120], ["created_at", "2017-10-22 23:43:23.258784"], ["updated_at", "2017-10-22 23:43:23.258784"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save